#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/hashicorp-github/hashicorp-github/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/hashicorp-github/hashicorp-github

To view this run in a browser, visit:
https://app.terraform.io/app/shohei-dev/github-demo/runs/run-zTQ1Fy3oaPpcmyEX

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
aws_kms_key.mykey: Refreshing state... [id=9d42d4b9-fa55-4971-941e-139eac9bae34]
aws_s3_bucket.gh-actions-demo: Refreshing state... [id=gh-actions-demo-foo]
aws_s3_bucket_server_side_encryption_configuration.gh-actions-demo: Refreshing state... [id=gh-actions-demo-foo]
aws_s3_bucket_versioning.gh-actions-demo: Refreshing state... [id=gh-actions-demo-foo]
aws_s3_bucket_public_access_block.gh-actions-demo: Refreshing state... [id=gh-actions-demo-foo]
aws_s3_object.gh-actions-demo: Refreshing state... [id=example.txt]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.gh-actions-demo has changed
  ~ resource "aws_s3_bucket" "gh-actions-demo" {
        id                          = "gh-actions-demo-foo"
      + tags                        = {}
        # (10 unchanged attributes hidden)


      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34"
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.gh-actions-demo has changed
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "gh-actions-demo" {
        id     = "gh-actions-demo-foo"
        # (1 unchanged attribute hidden)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34"
              + sse_algorithm     = "aws:kms"
            }
        }
      - rule {
          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
    }

  # aws_s3_object.gh-actions-demo has changed
  ~ resource "aws_s3_object" "gh-actions-demo" {
        id                     = "example.txt"
      + metadata               = {}
      + tags                   = {}
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.gh-actions-demo must be replaced
-/+ resource "aws_s3_bucket" "gh-actions-demo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gh-actions-demo-foo" -> (known after apply)
      ~ bucket                      = "gh-actions-demo-foo" -> "gh-actions-demo-bar" # forces replacement
      ~ bucket_domain_name          = "gh-actions-demo-foo.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "gh-actions-demo-foo.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "gh-actions-demo-foo" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "e50c3e414c8fe78e95b9885ceb171209b81b6a244748df946fe95d112b7d0a72" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  ~ kms_master_key_id = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34" -> (known after apply)
                  ~ sse_algorithm     = "aws:kms" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.gh-actions-demo must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "gh-actions-demo" {
      ~ bucket                  = "gh-actions-demo-foo" -> (known after apply) # forces replacement
      ~ id                      = "gh-actions-demo-foo" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.gh-actions-demo must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "gh-actions-demo" {
      ~ bucket = "gh-actions-demo-foo" -> "gh-actions-demo-bar" # forces replacement
      ~ id     = "gh-actions-demo-foo" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.gh-actions-demo must be replaced
-/+ resource "aws_s3_bucket_versioning" "gh-actions-demo" {
      ~ bucket = "gh-actions-demo-foo" -> (known after apply) # forces replacement
      ~ id     = "gh-actions-demo-foo" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_object.gh-actions-demo must be replaced
-/+ resource "aws_s3_object" "gh-actions-demo" {
      ~ bucket                 = "gh-actions-demo-foo" -> (known after apply) # forces replacement
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a9da5637d01b9e702c004b35e1378d94" -> (known after apply)
      ~ id                     = "example.txt" -> (known after apply)
      ~ kms_key_id             = "arn:aws:kms:ap-northeast-1:113542774039:key/9d42d4b9-fa55-4971-941e-139eac9bae34" -> (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "aws:kms" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version_id             = "E_bz1IQA83LDFPxw6HpcauTXQa8BYiEs" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.


```

</details>

*Pusher: @smaeda-ks, Action: `pull_request`*